In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {
    "name": ['harry', 'rohan', 'skillf', 'shubh'],
    "marks": [92, 34, 24, 17],
    "city": ['rampur', 'kolkata', 'bareilly', 'antartica']
}

In [3]:
df = pd.DataFrame(dict1)

In [9]:
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [5]:
df.iloc[0, 1]

92

In [6]:
df.loc[0, 'name']

'harry'

In [7]:
df.to_csv('friends.csv')

In [8]:
df.to_csv('friends_index_false.csv', index=False)

In [10]:
df.tail(2)

     name  marks       city
2  skillf     24   bareilly
3   shubh     17  antartica

In [11]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [14]:
harry =pd.read_csv('harry.csv')
harry.head(2)

   Train No  speed     city
0     12332     23   rampur
1     21312    434  kolkata

In [15]:
harry['speed']

0     23
1    434
2     34
3     54
Name: speed, dtype: int64

In [16]:
harry['speed'][0]

23

In [17]:
harry['speed'][0] = 50

/tmp/ipykernel_39255/1373715151.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  harry['speed'][0] = 50

In [18]:
harry

   Train No  speed       city
0     12332     50     rampur
1     21312    434    kolkata
2     33443     34   bareilly
3     23432     54  antartica

In [19]:
harry.to_csv('harry.csv')

In [22]:
harry.index = ['first', 'second', 'third', 'fourth']
harry

        Train No  speed       city
first      12332     50     rampur
second     21312    434    kolkata
third      33443     34   bareilly
fourth     23432     54  antartica

In [24]:
ser = pd.Series(np.random.rand(34))
ser

0     0.893803
1     0.608488
2     0.245382
3     0.611206
4     0.131315
5     0.921133
6     0.646493
7     0.255079
8     0.585562
9     0.752594
10    0.911513
11    0.676373
12    0.321083
13    0.062318
14    0.974582
15    0.086408
16    0.288207
17    0.893103
18    0.755164
19    0.104599
20    0.611153
21    0.248585
22    0.336219
23    0.014721
24    0.633397
25    0.219351
26    0.466968
27    0.475167
28    0.878644
29    0.101099
30    0.761335
31    0.557953
32    0.653512
33    0.781162
dtype: float64

In [25]:
type(ser)

pandas.core.series.Series

In [26]:
newdf = pd.DataFrame(np.random.rand(334, 5), index=np.arange(334))
newdf.head()

          0         1         2         3         4
0  0.810209  0.610001  0.136881  0.148879  0.818809
1  0.590203  0.912978  0.370478  0.960818  0.713965
2  0.664934  0.267054  0.770958  0.163966  0.671383
3  0.119425  0.904558  0.570511  0.505337  0.216560
4  0.825468  0.081574  0.666546  0.611949  0.825693

In [27]:
newdf.shape

(334, 5)

In [28]:
type(newdf)

pandas.core.frame.DataFrame

In [29]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.489582    0.506816    0.504817    0.513452    0.503031
std      0.297242    0.297143    0.297456    0.291413    0.284580
min      0.001228    0.001901    0.001041    0.002026    0.004776
25%      0.238199    0.236683    0.225152    0.259632    0.262637
50%      0.502921    0.524855    0.527587    0.541478    0.493725
75%      0.739170    0.768658    0.761853    0.751679    0.757483
max      0.998542    0.999944    0.994070    0.990504    0.999202

In [30]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [31]:
newdf[0][0] = 'harry'
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [32]:
newdf.head()

          0         1         2         3         4
0     harry  0.610001  0.136881  0.148879  0.818809
1  0.590203  0.912978  0.370478  0.960818  0.713965
2  0.664934  0.267054  0.770958  0.163966  0.671383
3  0.119425  0.904558  0.570511  0.505337  0.216560
4  0.825468  0.081574  0.666546  0.611949  0.825693

In [33]:
# to get index
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [34]:
# to get columns
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [36]:
newdf[0][0] = 0.3
newdf.to_numpy()

array([[0.3, 0.6100009967284531, 0.13688140220949918,
        0.14887864136113416, 0.8188091085664424],
       [0.5902026884520216, 0.9129778408770255, 0.37047849487838447,
        0.9608183236742593, 0.7139648412719722],
       [0.6649344974860535, 0.2670538616747524, 0.7709577137320747,
        0.16396576763037052, 0.6713831147983278],
       ...,
       [0.8896649342425758, 0.10692054031645581, 0.6952345595737408,
        0.0020259413821824834, 0.6778705815662249],
       [0.7245428159420287, 0.9348624749141109, 0.2720478762326516,
        0.6118086036573352, 0.11334124368108123],
       [0.4935335583678495, 0.23946000565176062, 0.5128098702731696,
        0.9756068576425894, 0.10453680412375155]], dtype=object)

In [37]:
type(newdf.to_numpy())

numpy.ndarray

In [38]:
newdf.head()

          0         1         2         3         4
0       0.3  0.610001  0.136881  0.148879  0.818809
1  0.590203  0.912978  0.370478  0.960818  0.713965
2  0.664934  0.267054  0.770958  0.163966  0.671383
3  0.119425  0.904558  0.570511  0.505337  0.216560
4  0.825468  0.081574  0.666546  0.611949  0.825693

In [39]:
# to get transpose
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.590203,0.664934,0.119425,0.825468,0.102519,0.96169,0.44362,0.990848,0.976658,...,0.981309,0.31324,0.085358,0.660575,0.05724,0.660871,0.201395,0.889665,0.724543,0.493534
1,0.610001,0.912978,0.267054,0.904558,0.081574,0.32308,0.18208,0.727806,0.338466,0.143392,...,0.938129,0.467387,0.194009,0.386346,0.356823,0.635337,0.574256,0.106921,0.934862,0.23946
2,0.136881,0.370478,0.770958,0.570511,0.666546,0.812856,0.197319,0.420511,0.991713,0.390535,...,0.668167,0.12686,0.519905,0.775546,0.191567,0.693622,0.064072,0.695235,0.272048,0.51281
3,0.148879,0.960818,0.163966,0.505337,0.611949,0.745648,0.202361,0.642496,0.622407,0.423766,...,0.704451,0.346117,0.200279,0.914848,0.857316,0.972898,0.118805,0.002026,0.611809,0.975607
4,0.818809,0.713965,0.671383,0.21656,0.825693,0.342632,0.121922,0.136511,0.567828,0.079498,...,0.45187,0.364265,0.899013,0.109437,0.765283,0.814685,0.929287,0.677871,0.113341,0.104537

In [40]:
# newdf2 is a view of newdf. Like a pointer
newdf2 = newdf

In [41]:
newdf2[0][0] = 978
newdf.head()

          0         1         2         3         4
0       978  0.610001  0.136881  0.148879  0.818809
1  0.590203  0.912978  0.370478  0.960818  0.713965
2  0.664934  0.267054  0.770958  0.163966  0.671383
3  0.119425  0.904558  0.570511  0.505337  0.216560
4  0.825468  0.081574  0.666546  0.611949  0.825693

In [42]:
# to get copy
newdf3 = newdf.copy()

In [43]:
newdf3[0][0] = 123
newdf.head()

/tmp/ipykernel_39255/412867064.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf3[0][0] = 123

          0         1         2         3         4
0       978  0.610001  0.136881  0.148879  0.818809
1  0.590203  0.912978  0.370478  0.960818  0.713965
2  0.664934  0.267054  0.770958  0.163966  0.671383
3  0.119425  0.904558  0.570511  0.505337  0.216560
4  0.825468  0.081574  0.666546  0.611949  0.825693

In [44]:
# To not get error while setting values
newdf.loc[0, 0] = 654
newdf.head()

          0         1         2         3         4
0       654  0.610001  0.136881  0.148879  0.818809
1  0.590203  0.912978  0.370478  0.960818  0.713965
2  0.664934  0.267054  0.770958  0.163966  0.671383
3  0.119425  0.904558  0.570511  0.505337  0.216560
4  0.825468  0.081574  0.666546  0.611949  0.825693

In [45]:
# To change columns
newdf.columns = list('ABCDE')
newdf.head()

          A         B         C         D         E
0       654  0.610001  0.136881  0.148879  0.818809
1  0.590203  0.912978  0.370478  0.960818  0.713965
2  0.664934  0.267054  0.770958  0.163966  0.671383
3  0.119425  0.904558  0.570511  0.505337  0.216560
4  0.825468  0.081574  0.666546  0.611949  0.825693

In [46]:
newdf.loc[0, 0] = 654
newdf.head()

          A         B         C         D         E      0
0       654  0.610001  0.136881  0.148879  0.818809  654.0
1  0.590203  0.912978  0.370478  0.960818  0.713965    NaN
2  0.664934  0.267054  0.770958  0.163966  0.671383    NaN
3  0.119425  0.904558  0.570511  0.505337  0.216560    NaN
4  0.825468  0.081574  0.666546  0.611949  0.825693    NaN

In [47]:
newdf.loc[0, 'A'] = 655
newdf.head()

          A         B         C         D         E      0
0       655  0.610001  0.136881  0.148879  0.818809  654.0
1  0.590203  0.912978  0.370478  0.960818  0.713965    NaN
2  0.664934  0.267054  0.770958  0.163966  0.671383    NaN
3  0.119425  0.904558  0.570511  0.505337  0.216560    NaN
4  0.825468  0.081574  0.666546  0.611949  0.825693    NaN

In [52]:
# axis = 0 for rows and axis = 1 for columns
newdf = newdf.drop(0, axis=1)
newdf.head()

          A         B         C         D         E
0       655  0.610001  0.136881  0.148879  0.818809
1  0.590203  0.912978  0.370478  0.960818  0.713965
2  0.664934  0.267054  0.770958  0.163966  0.671383
3  0.119425  0.904558  0.570511  0.505337  0.216560
4  0.825468  0.081574  0.666546  0.611949  0.825693

In [53]:
newdf.loc[[1, 2], ['C', 'D']]
# To change 
# newdf = newdf.loc[[1, 2], ['C', 'D']]

          C         D
1  0.370478  0.960818
2  0.770958  0.163966

In [54]:
newdf.head()

          A         B         C         D         E
0       655  0.610001  0.136881  0.148879  0.818809
1  0.590203  0.912978  0.370478  0.960818  0.713965
2  0.664934  0.267054  0.770958  0.163966  0.671383
3  0.119425  0.904558  0.570511  0.505337  0.216560
4  0.825468  0.081574  0.666546  0.611949  0.825693

In [55]:
# Use : to get all rows or columns
newdf.loc[[1, 2], :]

          A         B         C         D         E
1  0.590203  0.912978  0.370478  0.960818  0.713965
2  0.664934  0.267054  0.770958  0.163966  0.671383

In [56]:
newdf.loc[(newdf['A'] < 0.3) & (newdf['C'] > 0.1)]

          A         B         C         D        E
3  0.119425  0.904558  0.570511  0.505337  0.21656

In [57]:
# by using index
newdf.iloc[0, 4]

0.8188091085664424

In [58]:
newdf.iloc[[0, 1], [1, 2]]

          B         C
0  0.610001  0.136881
1  0.912978  0.370478

In [61]:
newdf.drop(['A', 'C'], axis=1, inplace=True)

In [62]:
newdf.head()

          B         D         E
0  0.610001  0.148879  0.818809
1  0.912978  0.960818  0.713965
2  0.267054  0.163966  0.671383
3  0.904558  0.505337  0.216560
4  0.081574  0.611949  0.825693

In [64]:
# to reset index
newdf.reset_index(drop=True, inplace=True)
newdf.head()

          B         D         E
0  0.610001  0.148879  0.818809
1  0.912978  0.960818  0.713965
2  0.267054  0.163966  0.671383
3  0.904558  0.505337  0.216560
4  0.081574  0.611949  0.825693

In [65]:
# check if any value is null
newdf['B'].isnull()

0    False
1    False
2    False
3    False
4    False
Name: B, dtype: bool

In [67]:
newdf.loc[:, ['B']] = None
newdf['B'].isnull()

0    True
1    True
2    True
3    True
4    True
Name: B, dtype: bool

In [68]:
newdf.loc[:, 'B'] = 56

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   marks   4 non-null      int64
 2   city    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [71]:
# dropna=False means to count NaN values also
# dropna=True means to not count NaN values
df['name'].value_counts(dropna=False)

name
harry     1
rohan     1
skillf    1
shubh     1
Name: count, dtype: int64

In [72]:
df.notnull()

   name  marks  city
0  True   True  True
1  True   True  True
2  True   True  True
3  True   True  True

In [73]:
df.isnull()

    name  marks   city
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [ ]:
# To read from excel
data = pd.read_excel('data.xlsx', sheet_name='Sheet1')
# install pip3 install xlrd